app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "published_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "published_date" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["published_date", "2024-05-19 10:40:00"], ["updated_at", "2024-05-19 13:39:58.624274"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)